Autodesk.Revit.DB.DocumentDifference.GetDeletedElementIds
Deleted element id collection.
For non-worksharing models, this will always be an empty collection.
Since:
2023

Autodesk.Revit.DB.DocumentDifference.GetModifiedElementIds
Modified element id collection.
Since:
2023

Autodesk.Revit.DB.DocumentDifference.GetCreatedElementIds
Created element id collection.
Since:
2023

Autodesk.Revit.DB.DocumentDifference.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DocumentDifference.AreDeletedElementIdsAvailable
Whether or the deleted elements were retrieved.
Since:
2023

Autodesk.Revit.DB.DocumentDifference
DocumentDifference represents the difference (including added elements, modified elements and deleted elements) of a Revit model between different DocumentVersion of the model.
Remarks:
For workshared models, DocumentDifference may contain all the added elements, modified elements and deleted elements.
For non-workshared models, deleted elements are not tracked, so this object may only contain added elements and modified elements.
Since:
2023